<a href="https://colab.research.google.com/github/vanoha/Machine-Learning/blob/Sem1/First_task_in_coursera.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
import numpy as np
import pandas as pd

In [14]:
df_titanic = pd.read_csv("titanic.csv")

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [53]:
df_titanic["Sex"].value_counts()
x = df_titanic["Survived"].value_counts()[0]
y = df_titanic["Survived"].value_counts()[1]
y / (x + y) * 100

38.38383838383838

In [54]:
df_titanic["Pclass"].value_counts()
x = df_titanic["Pclass"].value_counts()[1]
y = df_titanic["Pclass"].value_counts()[2] + df_titanic["Pclass"].value_counts()[3]
x / (y + x)

0.24242424242424243

In [25]:
mean = df_titanic["Age"].mean()
median = df_titanic["Age"].median()
mean,

(29.69911764705882, 28.0)

In [26]:
df_titanic.corr().loc['SibSp','Parch']

0.41483769862015263

In [85]:
import re
df_fe = {}
for i in range(0, len(df_titanic["Name"])):
  if df_titanic["Sex"][i] == 'female':
    match_pattern = re.findall(r"([a-zA-Z-']+)", df_titanic["Name"][i])
    for j in match_pattern:
      if j in df_fe.keys():
        df_fe[j] += 1
      else:
        df_fe[j] = 1
sorted_keys = sorted(df_fe, key=lambda x: int(df_fe[x]), reverse=True)
sorted_keys[2]

'Mary'